tutorials/surfaceDeformation/surfaceDeformation/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
150000
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    bottom
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
