tutorials/surfaceDeformation/surfaceDeformation/0/epss055
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
150000
(
0.568034
0.549422
0.466388
0.591012
0.584578
0.579629
0.510628
0.513907
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
